# CLI Utilities
brew "git"
brew "npm"
brew "stow"
brew "neovim"
brew "tmux"
brew "yazi"
brew "lazygit"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "eza"
brew "fzf"
brew "ripgrep"

# Terminal Emulator
cask "wezterm"

# Powerlevel10k prompt theme
brew "powerlevel10k"

# Fonts
cask "font-meslo-lg-nerd-font"
